Revit 2027 API
GroupTypeId.Profile Property
 Profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Profile { get; }
Public Shared ReadOnly Property Profile As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Profile {
	ForgeTypeId^ get ();
}
static member Profile : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace